<?php

return [

    /*
    |--------------------------------------------------------------------------
    | أسطر لغة إعادة تعيين كلمة المرور
    |--------------------------------------------------------------------------
    |
    | تحتوي الأسطر التالية على الرسائل الافتراضية التي تطابق الأسباب المختلفة
    | التي قد تؤدي إلى فشل عملية تحديث كلمة المرور، مثل رمز غير صالح أو كلمة مرور غير صحيحة.
    |
    */

    'reset' => 'تم إعادة تعيين كلمة المرور الخاصة بك.',
    'sent' => 'لقد أرسلنا رابط إعادة تعيين كلمة المرور إلى بريدك الإلكتروني.',
    'throttled' => 'يرجى الانتظار قبل المحاولة مرة أخرى.',
    'token' => 'رمز إعادة تعيين كلمة المرور غير صالح.',
    'user' => "لم نتمكن من العثور على مستخدم بهذا البريد الإلكتروني.",

];
